RT-Thread/rt-thread/bsp/renesas/ra6m3-hmi-board/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA6M3AH.h
    union
    {
        __IOM uint8_t JCVSZU;          /*!< (@ 0x00000007) JPEG Code Vertical Size Upper Register                     */

        struct
        {
            __IOM uint8_t VSZU : 8;    /*!< [7..0] Upper Bytes of Vertical Image SizeIn decompression process,
                                        *   a downloaded value from the JPEG coded data is set. NOTE:
                                        *   Read-only in Decompression.                                               */
        } JCVSZU_b;
    };

    union
    {
        __IOM uint8_t JCVSZD;          /*!< (@ 0x00000008) JPEG Code Vertical Size Lower Register                     */

        struct
        {
            __IOM uint8_t VSZD : 8;    /*!< [7..0] Lower Bytes of Vertical Image SizeIn decompression process,
                                        *   a downloaded value from the JPEG coded data is set. NOTE:
                                        *   Read-only in Decompression.                                               */
        } JCVSZD_b;
    };

    union
    {
        __IOM uint8_t JCHSZU;          /*!< (@ 0x00000009) JPEG Code Horizontal Size Upper Register                   */

        struct
        {
            __IOM uint8_t HSZU : 8;    /*!< [7..0] Upper Bytes of Horizontal Image SizeIn decompression
                                        *   process, a downloaded value from the JPEG coded data is
                                        *   set. NOTE: Read-only in Decompression.                                    */
        } JCHSZU_b;
    };

    union
    {
        __IOM uint8_t JCHSZD;          /*!< (@ 0x0000000A) JPEG Coded Horizontal Size Lower Register                  */

        struct
        {
            __IOM uint8_t HSZD : 8;    /*!< [7..0] Lower Bytes of Horizontal Image SizeIn decompression
                                        *   process, a downloaded value from the JPEG coded data is
                                        *   set. NOTE: Read-only in Decompression.                                    */
        } JCHSZD_b;
    };

    union
    {
        __IM uint8_t JCDTCU;           /*!< (@ 0x0000000B) JPEG Code Data Count Upper Register                        */

        struct
        {
            __IM uint8_t DCU : 8;      /*!< [7..0] Upper bytes of the counted amount of data to be compressed
                                        *   The values of this register are reset before compression
                                        *   starts.NOTE: Read-only in Decompression.                                  */
        } JCDTCU_b;
    };

    union
    {
        __IM uint8_t JCDTCM;           /*!< (@ 0x0000000C) JPEG Code Data Count Middle Register                       */

        struct
        {
            __IM uint8_t DCM : 8;      /*!< [7..0] Middle bytes of the counted amount of data to be compressedThe
                                        *   values of this register are reset before compression starts.
                                        *   NOTE: Read-only in Decompression.                                         */
        } JCDTCM_b;
    };

    union
    {
        __IM uint8_t JCDTCD;           /*!< (@ 0x0000000D) JPEG Code Data Count Lower Register                        */

        struct
        {
            __IM uint8_t DCD : 8;      /*!< [7..0] Lower bytes of the counted amount of data to be compressedThe
                                        *   values of this register are reset before compression starts.NOTE:
                                        *   Read-only in Decompression.                                               */
        } JCDTCD_b;
    };

    union
    {
        __IOM uint8_t JINTE0;          /*!< (@ 0x0000000E) JPEG Interrupt Enable Register 0                           */

        struct
        {
            uint8_t            : 3;
            __IOM uint8_t INT3 : 1;    /*!< [3..3] This bit enables an interrupt to be generated when it
                                        *   has been determined that the image size and the subsampling
                                        *   setting of the compressed data can be read through analyzing
                                        *   the data.                                                                 */
            uint8_t            : 1;
            __IOM uint8_t INT5 : 1;    /*!< [5..5] This bit enables an interrupt to be generated when the
                                        *   final number of MCU data in the Huffman-coding segment
                                        *   is not correct in decompression. When this bit is not set
                                        *   to enable interrupt generation, an error code is not returned.            */
            __IOM uint8_t INT6 : 1;    /*!< [6..6] This bit enables an interrupt to be generated when the
                                        *   total number of data in the Huffman-coding segment is not
                                        *   correct in decompression. When this bit is not set to enable
                                        *   interrupt generation, an error code is not returned.                      */
            __IOM uint8_t INT7 : 1;    /*!< [7..7] This bit enables an interrupt to be generated when the
                                        *   number of data in the restart interval of the Huffman-coding
                                        *   segment is not correct in decompression.When this bit is
                                        *   not set to enable interrupt generation, an error code is
                                        *   not returned.                                                             */
        } JINTE0_b;
    };

    union
    {
        __IOM uint8_t JINTS0;          /*!< (@ 0x0000000F) JPEG Interrupt Status Register 0                           */

        struct
        {
            uint8_t            : 3;
            __IOM uint8_t INS3 : 1;    /*!< [3..3] This bit is set to 1 when the image size and pixel format
                                        *   can be read. When an interrupt occurs, this module stops
                                        *   processing and the state is indicated by the JCRST register.
                                        *   To make this module resume processing, set the JPEG core
                                        *   process stop clear command bit (JRST) in JCCMD.                           */
            uint8_t            : 1;
            __IOM uint8_t INS5 : 1;    /*!< [5..5] This bit is set to 1 when a compressed data error occurs.          */
            __IOM uint8_t INS6 : 1;    /*!< [6..6] This bit is set to 1 when this module completes compression
                                        *   process normally.                                                         */
            uint8_t : 1;
        } JINTS0_b;
    };

    union
    {
        __IOM uint8_t JCDERR;          /*!< (@ 0x00000010) JPEG Code Decode Error Register                            */

        struct
        {
            __IOM uint8_t ERR : 4;     /*!< [3..0] Error Code (See tables )Identify the type of the error
                                        *   which has occurred in the compressed data analysis for
                                        *   decompression.                                                            */
            uint8_t : 4;
        } JCDERR_b;
    };

    union
    {
        __IM uint8_t JCRST;            /*!< (@ 0x00000011) JPEG Code Reset Register                                   */

        struct
        {
            __IM uint8_t RST : 1;      /*!< [0..0] Operating State                                                    */
            uint8_t          : 7;
        } JCRST_b;
    };
    __IM uint16_t RESERVED1;
    __IM uint32_t RESERVED2[11];

    union
    {
        __IOM uint32_t JIFECNT;          /*!< (@ 0x00000040) JPEG Interface Compression Control Register                */

        struct
        {
            __IOM uint32_t DINSWAP : 3;  /*!< [2..0] Byte/Halfword Swap                                                 */
            uint32_t               : 1;
            __IOM uint32_t DINLC   : 1;  /*!< [4..4] Count Mode Setting for Stopping Input Image Data Lines             */
            __OM uint32_t  DINRCMD : 1;  /*!< [5..5] Input Image Data Lines Resume Command This bit is valid
                                          *   only when the count mode for stopping the input of image
                                          *   data lines is on. Setting this bit to 1 resumes reading
                                          *   input image data. This bit is always read as 0.                           */
            __IOM uint32_t DINRINI : 1;  /*!< [6..6] Address Initialization when Resuming Input of Image Data
                                          *   Lines This bit is only valid when the count mode for stopping
                                          *   the input of image data lines is on. Set this bit before
                                          *   writing 1 to the data-line resume command bit.                            */
            uint32_t                : 1;
            __IOM uint32_t JOUTSWAP : 3; /*!< [10..8] Byte/Halfword/Word Swap Output coded data in compression
                                          *   is swapped.                                                               */
            uint32_t : 21;
        } JIFECNT_b;
    };

    union
    {
        __IOM uint32_t JIFESA;         /*!< (@ 0x00000044) JPEG Interface Compression Source Address Register         */

        struct
        {
            __IOM uint32_t ESA : 32;   /*!< [31..0] Input Image Data Source Address (in 8-byte units) The
                                        *   lower three bits should be set to 0.                                      */
        } JIFESA_b;
    };

    union
    {
        __IOM uint32_t JIFESOFST;      /*!< (@ 0x00000048) JPEG Interface Compression Line Offset Register            */

        struct
        {
            __IOM uint32_t ESMW : 15;  /*!< [14..0] Input Image Data Lines Offset(in 8-byte units)The lower
                                        *   three bits should be set to 0.                                            */
            uint32_t : 17;
        } JIFESOFST_b;
    };

    union
    {
        __IOM uint32_t JIFEDA;         /*!< (@ 0x0000004C) JPEG Interface Compression Destination Address
                                        *                  Register                                                   */

        struct
        {
            __IOM uint32_t EDA : 32;   /*!< [31..0] Input Image Data Lines Offset (in 8-byte units) The
                                        *   lower three bits should be set to 0.                                      */
        } JIFEDA_b;
    };

    union
    {
        __IOM uint32_t JIFESLC;        /*!< (@ 0x00000050) JPEG Interface Compression Source Line Count
                                        *                  Register                                                   */

        struct
        {
            __IOM uint32_t LINES : 16; /*!< [15..0] Number of Input Image Data Lines to be Read (in 8-line
                                        *   units) The lower three bits should be set to 0.                           */
            uint32_t : 16;
        } JIFESLC_b;
    };
    __IM uint32_t RESERVED3;

    union
    {
        __IOM uint32_t JIFDCNT;          /*!< (@ 0x00000058) JPEG Interface Decompression Control Register              */

        struct
        {
            __IOM uint32_t DOUTSWAP : 3; /*!< [2..0] Byte/Word Swap Output image data in decompression is
                                          *   swapped.                                                                  */
            uint32_t                : 1;
            __IOM uint32_t DOUTLC   : 1; /*!< [4..4] Count Mode for Stopping Output Image Data Lines                    */
            __OM uint32_t  DOUTRCMD : 1; /*!< [5..5] Output Image Data Lines Resume Command This bit is valid
                                          *   only when the count mode for stopping the output of image
                                          *   data lines is on. Setting this bit to 1 resumes writing
                                          *   image data. This bit is always read as 0.                                 */
            __IOM uint32_t DOUTRINI : 1; /*!< [6..6] Address Initialization when Resuming Output of Image
                                          *   Data Lines This bit is only valid when the count mode for
                                          *   stopping the output of image data lines is on. Set this
                                          *   bit before writing 1 to the data-line resume command bit.                 */
            uint32_t               : 1;
            __IOM uint32_t JINSWAP : 3;  /*!< [10..8] Byte/Word/Longword Swap Input coded data in decompression
                                          *   is swapped.                                                               */
            uint32_t               : 1;
            __IOM uint32_t JINC    : 1;  /*!< [12..12] Count Mode Setting for Stopping Input Coded Data                 */
            __OM uint32_t  JINRCMD : 1;  /*!< [13..13] Input Coded Data Resume CommandThis bit is valid only
                                          *   when the count mode for stopping the input of coded data
                                          *   is on. Setting this bit to 1 resumes reading input coded
                                          *   data. This bit is always read as 0.                                       */
            __IOM uint32_t JINRINI : 1;  /*!< [14..14] Address Initialization when Input Coded Data is Resumed
                                          *   This bit is only valid when the count mode for stopping
                                          *   the input of coded data is on. Set this bit before writing
                                          *   1 to the data resume command bit.                                         */
            uint32_t              : 9;
            __IOM uint32_t OPF    : 2;   /*!< [25..24] Specifies output image data pixel format.                        */
            __IOM uint32_t HINTER : 2;   /*!< [27..26] Horizontal Subsampling Subsamples horizontal output
                                          *   image data.                                                               */
            __IOM uint32_t VINTER : 2;   /*!< [29..28] Vertical SubsamplingSubsamples vertical output image
                                          *   data.                                                                     */
            uint32_t : 2;
        } JIFDCNT_b;
    };

    union
    {
        __IOM uint32_t JIFDSA;         /*!< (@ 0x0000005C) JPEG Interface Decompression Source Address Register       */

        struct
        {
            __IOM uint32_t DSA : 32;   /*!< [31..0] Input Coded Data Source AddressInput Coded Data Source
                                        *   Address (in 8-byte units) The lower three bits should be
                                        *   set to 0.                                                                 */
        } JIFDSA_b;
    };

    union
    {
        __IOM uint32_t JIFDDOFST;      /*!< (@ 0x00000060) JPEG Interface Decompression Line Offset Register          */

        struct
        {
            __IOM uint32_t DDMW : 15;  /*!< [14..0] Output Image Data Lines Offset (in 8-byte units) The
                                        *   lower three bits should be set to 0.                                      */
            uint32_t : 17;
        } JIFDDOFST_b;
    };

    union
    {
        __IOM uint32_t JIFDDA;         /*!< (@ 0x00000064) JPEG Interface Decompression Destination Address
                                        *                  Register                                                   */

        struct
        {
            __IOM uint32_t DDA : 32;   /*!< [31..0] Output Image Data Destination Address (in 8-byte units)
                                        *   The lower three bits should be set to 0.                                  */
        } JIFDDA_b;
    };

    union
    {
        __IOM uint32_t JIFDSDC;         /*!< (@ 0x00000068) JPEG Interface Decompression Source Data Count
                                         *                  Register                                                   */

        struct
        {
            __IOM uint32_t JDATAS : 16; /*!< [15..0] Amount of Input Coded Data to be Read (in 8-byte units)
                                         *   The lower three bits should be set to 0.                                  */
            uint32_t : 16;
        } JIFDSDC_b;
    };

    union
    {
        __IOM uint32_t JIFDDLC;        /*!< (@ 0x0000006C) JPEG Interface Decompression Destination Line
                                        *                  Count Register                                             */

        struct
        {
            __IOM uint32_t LINES : 16; /*!< [15..0] Number of Input Image Lines to Be ReadThe lower three
                                        *   bits should be set to 0. These bits are read as0.Number
                                        *   of input image data lines to be read, in 8-line units.                    */
            uint32_t : 16;
        } JIFDDLC_b;
    };

    union
    {
        __IOM uint32_t JIFDADT;        /*!< (@ 0x00000070) JPEG Interface Decompression alpha Set Register            */

        struct
        {
            __IOM uint32_t ALPHA : 8;  /*!< [7..0] Setting of the alpha value for output in ARGB8888 format.          */
            uint32_t             : 24;
        } JIFDADT_b;
    };
    __IM uint32_t RESERVED4[6];

    union
    {
        __IOM uint32_t JINTE1;          /*!< (@ 0x0000008C) JPEG Interrupt Enable Register 1                           */

        struct
        {
            __IOM uint32_t DOUTLEN : 1; /*!< [0..0] Enables or disables a data transfer processing interrupt
                                         *   request (JDTI) when the DOUTLF bit in JINTS1 is set to
                                         *   1                                                                         */
            __IOM uint32_t JINEN : 1;   /*!< [1..1] Enables or disables a data transfer processing interrupt
                                         *   request (JDTI) when the JINF bit in JINTS1 is set to 1.                   */
            __IOM uint32_t DBTEN : 1;   /*!< [2..2] Enables or disables a data transfer processing interrupt
                                         *   request (JDTI) when the DBTF bit in JINTS1 is set to 1.                   */
            uint32_t              : 2;
            __IOM uint32_t DINLEN : 1;  /*!< [5..5] Enables or disables a data transfer processing interrupt
                                         *   request (JDTI) when the DINLF bit in JINTS1 is set to 1.                  */
            __IOM uint32_t CBTEN : 1;   /*!< [6..6] Enables or disables a data transfer processing interrupt
                                         *   request (JDTI) when the CBTF bit in JINTS1 is set to 1.                   */
            uint32_t : 25;
        } JINTE1_b;
    };

    union
    {
        __IOM uint32_t JINTS1;         /*!< (@ 0x00000090) JPEG Interrupt Status Register 1                           */

        struct
        {
            __IOM uint32_t DOUTLF : 1; /*!< [0..0] In decompression, this bit is set to 1 when the number
                                        *   of lines of output image data indicated by JIFDDLC have
                                        *   been written. This bit is only valid when the DOUTLC bit
                                        *   in JIFDCNT is set to 1.                                                   */
            __IOM uint32_t JINF : 1;   /*!< [1..1] This bit is set to 1 when the amount of input coded data
                                        *   indicated by JIFDSDC is read in decompression. This bit
                                        *   is valid only when the JINC bit in JIFDCNT is set to 1.                   */
            __IOM uint32_t DBTF : 1;   /*!< [2..2] This bit is set to 1 when the last output image data
                                        *   is written in decompression.                                              */
            uint32_t             : 2;
            __IOM uint32_t DINLF : 1;  /*!< [5..5] This bit is set to 1 when the number of input image data
                                        *   lines indicated by JIFESLC is read in compression. This
                                        *   bit is valid only when the DINLC bit in JIFECNT is set
                                        *   to 1.                                                                     */
            __IOM uint32_t CBTF : 1;   /*!< [6..6] This bit is set to 1 when the last output coded data
                                        *   is written in compression.                                                */
            uint32_t : 25;
        } JINTS1_b;
    };
    __IM uint32_t RESERVED5[27];
    __OM uint8_t  JCQTBL0[64];         /*!< (@ 0x00000100) Quantization Table 0                                       */
    __OM uint8_t  JCQTBL1[64];         /*!< (@ 0x00000140) Quantization Table 1                                       */
    __OM uint8_t  JCQTBL2[64];         /*!< (@ 0x00000180) Quantization Table 2                                       */
    __OM uint8_t  JCQTBL3[64];         /*!< (@ 0x000001C0) Quantization Table 3                                       */
    __IOM uint8_t JCHTBD0[28];         /*!< (@ 0x00000200) DC Huffman Table 0                                         */
    __IM uint32_t RESERVED6;
    __IOM uint8_t JCHTBA0[178];        /*!< (@ 0x00000220) AC Huffman Table 0                                         */
    __IM uint16_t RESERVED7;
    __IM uint32_t RESERVED8[11];
    __IOM uint8_t JCHTBD1[28];         /*!< (@ 0x00000300) DC Huffman Table 1                                         */
    __IM uint32_t RESERVED9;
    __IOM uint8_t JCHTBA1[178];        /*!< (@ 0x00000320) DC Huffman Table 1                                         */
    __IM uint16_t RESERVED10;
} R_JPEG_Type;                         /*!< Size = 980 (0x3d4)                                                        */

/* =========================================================================================================================== */
/* ================                                          R_KINT                                           ================ */
/* =========================================================================================================================== */

/**
 * @brief Key Interrupt Function (R_KINT)
 */

typedef struct                         /*!< (@ 0x40080000) R_KINT Structure                                           */
{
    union
    {
        __IOM uint8_t KRCTL;           /*!< (@ 0x00000000) KEY Return Control Register                                */

        struct
        {
            __IOM uint8_t KREG : 1;    /*!< [0..0] Detection Edge Selection (KRF0 to KRF7)                            */
            uint8_t            : 6;
            __IOM uint8_t KRMD : 1;    /*!< [7..7] Usage of Key Interrupt Flags(KR0 to KR7)                           */
        } KRCTL_b;
    };
    __IM uint8_t RESERVED[3];

    union
    {
        __IOM uint8_t KRF;             /*!< (@ 0x00000004) KEY Return Flag Register                                   */

